load-tests/basic.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 3
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 3
      arrivalRate: 1
      rampTo: 1
      name: Ramp up load
    - duration: 3
      arrivalRate: 1
      rampTo: 1
      name: Spike phase

  engines:
    playwright:
      launchOptions:
        headless: true
  processor: ".././e2e/test-1.spec.cjs"  # Peka på din testfil

scenarios:
  - name: "Curious User Scenario"
    engine: playwright
    testFunction: "curiousUser"  # Peka på den asynkrona funktionen
  - name: "Knower User Scenario"
    engine: playwright
    testFunction: "knowerUser"  # Peka på den andra asynkrona funktionen
  - name: "Comparer User Scenario"
    engine: playwright
    testFunction: "comparerUser"  # Peka på en tredje användartest
  - name: "Greedy User Scenario"
    engine: playwright
    testFunction: "greedyUser"  # Peka på den fjärde användartest