load-tests/basic.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Ramp up load
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Spike phase
  # Engines and File locations for Playwright tests
  engines:
    playwright:
        launchOptions:
          headless: false
        #scripts: "./playwright-tests/test.cjs"
        #contextOptions:
    #här pekar vi på Playwright test kod filer 
  processor: ".././playwright-tests/test.cjs"
    
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - name: "Checking images on some categories"
    engine: playwright
    testFunction: "imgCheck"
    #flow:
      #- get:
          #url: "/kategori/frukt-och-gront"
      #- get:
          #url: "/kategori/blommor-och-tradgard"
      #- get:
          #url: "/kategori/apotek"
       # count: 2